tutorials/lagrangian/icoLagrangianFoam/channelParticles/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    topAndBottom
    {
        type            wall;
        nFaces          200;
        startFace       1890;
    }
    in
    {
        type            patch;
        nFaces          10;
        startFace       2090;
    }
    out
    {
        type            patch;
        nFaces          10;
        startFace       2100;
    }
    frontAndBack
    {
        type            empty;
        nFaces          2000;
        startFace       2110;
    }
)


// ************************************************************************* //
